#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#define max(a, b) (((a) > (b)) ? (a) : (b)) /* ２個の値の最大値 */
#define min(a, b) (((a) < (b)) ? (a) : (b)) /* ２個の値の最小値 */
#define ENTER printf("\n")                  /* 改行プリント */
/********************************************************************************************************************************/
/* main
 * *************************************************************************************************************************/
/********************************************************************************************************************************/
int DEBUG = 0; /* デバッグプリント 提出時は0 */
int main() {
  int i, ans = 0;
  char S[100] = {0};

  scanf("%s", &S);

  for (i = 0; i < 15; i++) {
    if (S[i] != 'x')
      ans++;
  }
  if (ans >= 8)
    printf("YES\n");
  else
    printf("NO\n");

  if (DEBUG)
    printf("%s\n", S);
  return 0;
}
